Loading the data set

In [15]:
import pandas as pd
import numpy as py

In [16]:
df = pd.read_csv(r"C:\Users\LENOVO\Desktop\theory.py\Titanic-Dataset.csv")
# df=data frame

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### looking the loaded data using head and tail method

In [18]:
df.tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [19]:
df.sample(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,0,PC 17593,79.2000,B82 B84,C
314,315,0,2,"Hart, Mr. Benjamin",male,43.0,1,1,F.C.C. 13529,26.2500,NaN,S
621,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,0,11753,52.5542,D19,S
161,162,1,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.0,0,0,C.A. 33595,15.7500,NaN,S

display the list of column

In [20]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Selecting the single column and multiple column

In [21]:
df["PassengerId"]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [22]:

df[["PassengerId", "Name","Age"]]

     PassengerId                                               Name   Age
0              1                            Braund, Mr. Owen Harris  22.0
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2              3                             Heikkinen, Miss. Laina  26.0
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4              5                           Allen, Mr. William Henry  35.0
..           ...                                                ...   ...
886          887                              Montvila, Rev. Juozas  27.0
887          888                       Graham, Miss. Margaret Edith  19.0
888          889           Johnston, Miss. Catherine Helen "Carrie"   NaN
889          890                              Behr, Mr. Karl Howell  26.0
890          891                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

### Slicing un pandas using (loc and iloc)

In [23]:
df.loc[500:510, ["PassengerId", "Name","Age"]]

     PassengerId                                           Name   Age
500          501                               Calic, Mr. Petar  17.0
501          502                            Canavan, Miss. Mary  21.0
502          503                 O'Sullivan, Miss. Bridget Mary   NaN
503          504                 Laitinen, Miss. Kristina Sofia  37.0
504          505                          Maioni, Miss. Roberta  16.0
505          506     Penasco y Castellana, Mr. Victor de Satode  18.0
506          507  Quick, Mrs. Frederick Charles (Jane Richards)  33.0
507          508  Bradley, Mr. George ("George Arthur Brayton")   NaN
508          509                       Olsen, Mr. Henry Margido  28.0
509          510                                 Lang, Mr. Fang  26.0
510          511                       Daly, Mr. Eugene Patrick  29.0

In [24]:
df.loc[50:510, "PassengerId":"Age"]

,PassengerId,Survived,Pclass,Name,Sex,Age
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.0
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.0
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0
...,...,...,...,...,...,...
506,507,1,2,"Quick, Mrs. Frederick Charles (Jane Richards)",female,33.0
507,508,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN
508,509,0,3,"Olsen, Mr. Henry Margido",male,28.0
509,510,1,3,"Lang, Mr. Fang",male,26.0
510,511,1,3,"Daly, Mr. Eugene Patrick",male,29.0

In [25]:
df.iloc[100:110, 3:8]

                                 Name     Sex   Age  SibSp  Parch
100           Petranec, Miss. Matilda  female  28.0      0      0
101  Petroff, Mr. Pastcho ("Pentcho")    male   NaN      0      0
102         White, Mr. Richard Frasar    male  21.0      0      1
103        Johansson, Mr. Gustaf Joel    male  33.0      0      0
104    Gustafsson, Mr. Anders Vilhelm    male  37.0      2      0
105             Mionoff, Mr. Stoytcho    male  28.0      0      0
106  Salkjelsvik, Miss. Anna Kristine  female  21.0      0      0
107            Moss, Mr. Albert Johan    male   NaN      0      0
108                   Rekic, Mr. Tido    male  38.0      0      0
109               Moran, Miss. Bertha  female   NaN      1      0

In [26]:
df.iloc[100:110, 3:7]

                                 Name     Sex   Age  SibSp
100           Petranec, Miss. Matilda  female  28.0      0
101  Petroff, Mr. Pastcho ("Pentcho")    male   NaN      0
102         White, Mr. Richard Frasar    male  21.0      0
103        Johansson, Mr. Gustaf Joel    male  33.0      0
104    Gustafsson, Mr. Anders Vilhelm    male  37.0      2
105             Mionoff, Mr. Stoytcho    male  28.0      0
106  Salkjelsvik, Miss. Anna Kristine  female  21.0      0
107            Moss, Mr. Albert Johan    male   NaN      0
108                   Rekic, Mr. Tido    male  38.0      0
109               Moran, Miss. Bertha  female   NaN      1

### TO select rendom column

In [27]:

df[["PassengerId", "Name","Age"]]
# to make your own costum data-set

     PassengerId                                               Name   Age
0              1                            Braund, Mr. Owen Harris  22.0
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2              3                             Heikkinen, Miss. Laina  26.0
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4              5                           Allen, Mr. William Henry  35.0
..           ...                                                ...   ...
886          887                              Montvila, Rev. Juozas  27.0
887          888                       Graham, Miss. Margaret Edith  19.0
888          889           Johnston, Miss. Catherine Helen "Carrie"   NaN
889          890                              Behr, Mr. Karl Howell  26.0
890          891                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

### Getting information about the data

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Checking missing values

In [ ]:
df.isnull()

# true= missing value

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [30]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

###